<abi-corpus version='2.0' path='btmp1/libz-ng.so.2.0.0' architecture='elf-amd-x86_64' soname='libz-ng.so.2'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='zlibng_version' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_adler32' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_adler32_combine' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_adler32_z' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_compress2' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_compress' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_compressBound' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='zng_inflateInit2_' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateInit_' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateMark' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflatePrime' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateReset2' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateReset' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateResetKeep' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateSetDictionary' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateSync' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateSyncPoint' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateUndermine' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_inflateValidate' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_uncompress2' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_uncompress' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_zError' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='zng_zlibCompileFlags' version='ZLIB_NG_2.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='zlibng_string' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='/home/dank/src/zlib-ng/btmp1/src.d/adler32.c' comp-dir-path='/home/dank/src/zlib-ng/btmp1' language='LANG_C99'>
    <type-decl name='long int' size-in-bits='64' id='type-id-1'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-2'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-3'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-4'/>
    <typedef-decl name='uint32_t' type-id='type-id-5' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-6'/>
    <typedef-decl name='__uint32_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-5'/>
    <typedef-decl name='__off64_t' type-id='type-id-1' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-7'/>
    <typedef-decl name='off64_t' type-id='type-id-7' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='92' column='1' id='type-id-8'/>
    <typedef-decl name='size_t' type-id='type-id-4' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='209' column='1' id='type-id-9'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-10'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-11'/>
    <function-decl name='zng_adler32_z' mangled-name='zng_adler32_z' filepath='/home/dank/src/zlib-ng/btmp1/src.d/adler32.c' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_adler32_z@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-6' name='adler' filepath='/home/dank/src/zlib-ng/btmp1/src.d/adler32.c' line='85' column='1'/>
      <parameter type-id='type-id-11' name='buf' filepath='/home/dank/src/zlib-ng/btmp1/src.d/adler32.c' line='85' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/home/dank/src/zlib-ng/btmp1/src.d/adler32.c' line='85' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zng_adler32' mangled-name='zng_adler32' filepath='/home/dank/src/zlib-ng/btmp1/src.d/adler32.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_adler32@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-6' name='adler' filepath='/home/dank/src/zlib-ng/btmp1/src.d/adler32.c' line='96' column='1'/>
      <parameter type-id='type-id-11' name='buf' filepath='/home/dank/src/zlib-ng/btmp1/src.d/adler32.c' line='96' column='1'/>
      <parameter type-id='type-id-6' name='len' filepath='/home/dank/src/zlib-ng/btmp1/src.d/adler32.c' line='96' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zng_adler32_combine' mangled-name='zng_adler32_combine' filepath='/home/dank/src/zlib-ng/btmp1/src.d/adler32.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_adler32_combine@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-6' name='adler1' filepath='/home/dank/src/zlib-ng/btmp1/src.d/adler32.c' line='136' column='1'/>
      <parameter type-id='type-id-6' name='adler2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/adler32.c' line='136' column='1'/>
      <parameter type-id='type-id-8' name='len2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/adler32.c' line='136' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' comp-dir-path='/home/dank/src/zlib-ng/btmp1' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-12'/>
    <class-decl name='internal_state' size-in-bits='48320' is-struct='yes' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='103' column='1' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='strm' type-id='type-id-14' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pending_buf' type-id='type-id-15' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_out' type-id='type-id-15' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pending_buf_size' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='pending' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='wrap' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='gzindex' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='gzhead' type-id='type-id-17' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='status' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='last_flush' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='reproducible' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='block_open' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='w_size' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='w_bits' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='w_mask' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='lookahead' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='high_water' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='window_size' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='window' type-id='type-id-15' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='prev' type-id='type-id-18' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='head' type-id='type-id-18' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='block_start' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='match_length' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='prev_match' type-id='type-id-19' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='match_available' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='strstart' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='match_start' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='prev_length' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='max_chain_length' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='max_lazy_match' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='level' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='strategy' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='good_match' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nice_match' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='crc0' type-id='type-id-20' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='dyn_ltree' type-id='type-id-21' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20288'>
        <var-decl name='dyn_dtree' type-id='type-id-22' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22240'>
        <var-decl name='bl_tree' type-id='type-id-23' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23488'>
        <var-decl name='l_desc' type-id='type-id-24' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23680'>
        <var-decl name='d_desc' type-id='type-id-24' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23872'>
        <var-decl name='bl_desc' type-id='type-id-24' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24064'>
        <var-decl name='bl_count' type-id='type-id-25' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24320'>
        <var-decl name='heap' type-id='type-id-26' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42656'>
        <var-decl name='heap_len' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42688'>
        <var-decl name='heap_max' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42720'>
        <var-decl name='depth' type-id='type-id-27' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47328'>
        <var-decl name='lit_bufsize' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47360'>
        <var-decl name='sym_buf' type-id='type-id-15' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47424'>
        <var-decl name='sym_next' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47456'>
        <var-decl name='sym_end' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47488'>
        <var-decl name='opt_len' type-id='type-id-4' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47552'>
        <var-decl name='static_len' type-id='type-id-4' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47616'>
        <var-decl name='matches' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47648'>
        <var-decl name='insert' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47680'>
        <var-decl name='compressed_len' type-id='type-id-4' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47744'>
        <var-decl name='bits_sent' type-id='type-id-4' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47808'>
        <var-decl name='reserved_p' type-id='type-id-28' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47872'>
        <var-decl name='bi_buf' type-id='type-id-29' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47936'>
        <var-decl name='bi_valid' type-id='type-id-30' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47968'>
        <var-decl name='reserved' type-id='type-id-31' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='269' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-16'/>
    <type-decl name='void' id='type-id-32'/>
    <typedef-decl name='alloc_func' type-id='type-id-33' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='80' column='1' id='type-id-34'/>
    <typedef-decl name='free_func' type-id='type-id-35' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='81' column='1' id='type-id-36'/>
    <class-decl name='zng_stream_s' size-in-bits='832' is-struct='yes' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='85' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next_in' type-id='type-id-38' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avail_in' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='total_in' type-id='type-id-9' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next_out' type-id='type-id-39' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avail_out' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='total_out' type-id='type-id-9' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='msg' type-id='type-id-40' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='state' type-id='type-id-41' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='zalloc' type-id='type-id-34' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='zfree' type-id='type-id-36' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='opaque' type-id='type-id-42' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='data_type' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='adler' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reserved' type-id='type-id-4' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='104' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zng_stream' type-id='type-id-37' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='105' column='1' id='type-id-43'/>
    <typedef-decl name='int32_t' type-id='type-id-44' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-30'/>
    <typedef-decl name='uint8_t' type-id='type-id-45' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-46'/>
    <typedef-decl name='__uint8_t' type-id='type-id-2' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-45'/>
    <typedef-decl name='__int32_t' type-id='type-id-16' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-44'/>
    <qualified-type-def type-id='type-id-12' const='yes' id='type-id-47'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-40'/>
    <qualified-type-def type-id='type-id-46' const='yes' id='type-id-48'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-42'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-14'/>
    <function-decl name='zng_compress2' mangled-name='zng_compress2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_compress2@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-15' name='dest' filepath='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' line='25' column='1'/>
      <parameter type-id='type-id-49' name='destLen' filepath='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' line='25' column='1'/>
      <parameter type-id='type-id-11' name='source' filepath='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' line='25' column='1'/>
      <parameter type-id='type-id-9' name='sourceLen' filepath='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' line='26' column='1'/>
      <parameter type-id='type-id-16' name='level' filepath='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' line='26' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_compress' mangled-name='zng_compress' filepath='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_compress@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-15' name='dest' filepath='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' line='67' column='1'/>
      <parameter type-id='type-id-49' name='destLen' filepath='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' line='67' column='1'/>
      <parameter type-id='type-id-11' name='source' filepath='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' line='67' column='1'/>
      <parameter type-id='type-id-9' name='sourceLen' filepath='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' line='67' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_compressBound' mangled-name='zng_compressBound' filepath='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_compressBound@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-9' name='sourceLen' filepath='/home/dank/src/zlib-ng/btmp1/src.d/compress.c' line='75' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='zng_deflate' mangled-name='zng_deflate' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflate@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflateEnd' mangled-name='zng_deflateEnd' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateEnd@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflateInit_' mangled-name='zng_deflateInit_' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateInit_@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-50'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-51'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-42'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='/home/dank/src/zlib-ng/btmp1/src.d/crc32.c' comp-dir-path='/home/dank/src/zlib-ng/btmp1' language='LANG_C99'>
    <class-decl name='static_tree_desc_s' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-52'/>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='1248' id='type-id-23'>
      <subrange length='39' type-id='type-id-4' id='type-id-54'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='18336' id='type-id-21'>
      <subrange length='573' type-id='type-id-4' id='type-id-55'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='1952' id='type-id-22'>
      <subrange length='61' type-id='type-id-4' id='type-id-56'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-30' size-in-bits='352' id='type-id-31'>
      <subrange length='11' type-id='type-id-4' id='type-id-57'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='18336' id='type-id-26'>
      <subrange length='573' type-id='type-id-4' id='type-id-55'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-58' size-in-bits='256' id='type-id-25'>
      <subrange length='16' type-id='type-id-4' id='type-id-59'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='4584' id='type-id-27'>
      <subrange length='573' type-id='type-id-4' id='type-id-55'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='640' id='type-id-20'>
      <subrange length='20' type-id='type-id-4' id='type-id-60'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-61'/>
    <class-decl name='ct_data_s' size-in-bits='32' is-struct='yes' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='73' column='1' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fc' type-id='type-id-62' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dl' type-id='type-id-63' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='16' is-anonymous='yes' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='74' column='1' id='type-id-62'>
      <data-member access='public'>
        <var-decl name='freq' type-id='type-id-58' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='75' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='code' type-id='type-id-58' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='76' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='16' is-anonymous='yes' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='78' column='1' id='type-id-63'>
      <data-member access='public'>
        <var-decl name='dad' type-id='type-id-58' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='79' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='len' type-id='type-id-58' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='80' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='ct_data' type-id='type-id-53' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='82' column='1' id='type-id-64'/>
    <typedef-decl name='static_tree_desc' type-id='type-id-52' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='89' column='1' id='type-id-65'/>
    <class-decl name='tree_desc_s' size-in-bits='192' is-struct='yes' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='91' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dyn_tree' type-id='type-id-66' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_code' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stat_desc' type-id='type-id-67' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Pos' type-id='type-id-58' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='97' column='1' id='type-id-19'/>
    <typedef-decl name='deflate_state' type-id='type-id-13' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='270' column='1' id='type-id-68'/>
    <class-decl name='zng_gz_header_s' size-in-bits='640' is-struct='yes' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='113' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='text' type-id='type-id-30' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='time' type-id='type-id-4' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='xflags' type-id='type-id-30' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='os' type-id='type-id-30' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='extra' type-id='type-id-39' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='extra_len' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='extra_max' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='name' type-id='type-id-39' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='name_max' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='comment' type-id='type-id-39' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='comm_max' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='hcrc' type-id='type-id-30' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='done' type-id='type-id-30' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='126' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zng_gz_header' type-id='type-id-69' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='127' column='1' id='type-id-70'/>
    <typedef-decl name='zng_gz_headerp' type-id='type-id-71' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='129' column='1' id='type-id-17'/>
    <typedef-decl name='uint16_t' type-id='type-id-72' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='25' column='1' id='type-id-58'/>
    <typedef-decl name='uint64_t' type-id='type-id-73' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-29'/>
    <typedef-decl name='__uint16_t' type-id='type-id-61' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-72'/>
    <typedef-decl name='__uint64_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-73'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-28'/>
    <qualified-type-def type-id='type-id-65' const='yes' id='type-id-74'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-67'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-75'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-77'/>
    <qualified-type-def type-id='type-id-77' const='yes' id='type-id-78'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-71'/>
    <class-decl name='static_tree_desc_s' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-52'/>
    <function-decl name='crc_fold_init' filepath='/home/dank/src/zlib-ng/btmp1/src.d/arch/x86/crc_folding.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-78'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='crc_fold_512to32' filepath='/home/dank/src/zlib-ng/btmp1/src.d/arch/x86/crc_folding.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-78'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='crc_fold_copy' filepath='/home/dank/src/zlib-ng/btmp1/src.d/arch/x86/crc_folding.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='x86_check_features' filepath='/home/dank/src/zlib-ng/btmp1/src.d/arch/x86/x86.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='zng_get_crc_table' mangled-name='zng_get_crc_table' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_get_crc_table@@ZLIB_NG_2.0.0'>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='zng_crc32_z' mangled-name='zng_crc32_z' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_crc32_z@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-6' name='crc' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32.c' line='33' column='1'/>
      <parameter type-id='type-id-11' name='buf' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32.c' line='33' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32.c' line='33' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zng_crc32' mangled-name='zng_crc32' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_crc32@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-6' name='crc' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32.c' line='71' column='1'/>
      <parameter type-id='type-id-11' name='buf' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32.c' line='71' column='1'/>
      <parameter type-id='type-id-6' name='len' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32.c' line='71' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/home/dank/src/zlib-ng/btmp1/src.d/crc32_comb.c' comp-dir-path='/home/dank/src/zlib-ng/btmp1' language='LANG_C99'>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-79'/>
    <function-decl name='zng_crc32_combine' mangled-name='zng_crc32_combine' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32_comb.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_crc32_combine@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-6' name='crc1' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32_comb.c' line='45' column='1'/>
      <parameter type-id='type-id-6' name='crc2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32_comb.c' line='45' column='1'/>
      <parameter type-id='type-id-8' name='len2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32_comb.c' line='45' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='zng_crc32_combine_gen' mangled-name='zng_crc32_combine_gen' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32_comb.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_crc32_combine_gen@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-79' name='op' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32_comb.c' line='101' column='1'/>
      <parameter type-id='type-id-8' name='len2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32_comb.c' line='101' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='zng_crc32_combine_op' mangled-name='zng_crc32_combine_op' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32_comb.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_crc32_combine_op@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-6' name='crc1' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32_comb.c' line='106' column='1'/>
      <parameter type-id='type-id-6' name='crc2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32_comb.c' line='106' column='1'/>
      <parameter type-id='type-id-76' name='op' filepath='/home/dank/src/zlib-ng/btmp1/src.d/crc32_comb.c' line='106' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' comp-dir-path='/home/dank/src/zlib-ng/btmp1' language='LANG_C99'>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-80'/>
    <enum-decl name='block_state' naming-typedef-id='type-id-81' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='272' column='1' id='type-id-82'>
      <underlying-type type-id='type-id-80'/>
      <enumerator name='need_more' value='0'/>
      <enumerator name='block_done' value='1'/>
      <enumerator name='finish_started' value='2'/>
      <enumerator name='finish_done' value='3'/>
    </enum-decl>
    <typedef-decl name='block_state' type-id='type-id-82' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='277' column='1' id='type-id-81'/>
    <enum-decl name='zng_deflate_param' naming-typedef-id='type-id-83' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1823' column='1' id='type-id-84'>
      <underlying-type type-id='type-id-80'/>
      <enumerator name='Z_DEFLATE_LEVEL' value='0'/>
      <enumerator name='Z_DEFLATE_STRATEGY' value='1'/>
      <enumerator name='Z_DEFLATE_REPRODUCIBLE' value='2'/>
    </enum-decl>
    <typedef-decl name='zng_deflate_param' type-id='type-id-84' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1833' column='1' id='type-id-83'/>
    <class-decl name='zng_deflate_param_value' size-in-bits='256' is-struct='yes' naming-typedef-id='type-id-85' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1835' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='param' type-id='type-id-83' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='buf' type-id='type-id-42' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1837' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-9' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='status' type-id='type-id-30' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1839' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='zng_deflate_param_value' type-id='type-id-86' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1840' column='1' id='type-id-85'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-88'/>
    <function-decl name='deflate_fast' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='deflate_quick' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='deflate_medium' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='deflate_slow' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='crc_reset' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-78'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='crc_finalize' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-78'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='copy_with_crc' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='zng_deflateInit2_' mangled-name='zng_deflateInit2_' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateInit2_@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='255' column='1'/>
      <parameter type-id='type-id-30' name='level' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='255' column='1'/>
      <parameter type-id='type-id-30' name='method' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='255' column='1'/>
      <parameter type-id='type-id-30' name='windowBits' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='255' column='1'/>
      <parameter type-id='type-id-30' name='memLevel' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='256' column='1'/>
      <parameter type-id='type-id-30' name='strategy' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='256' column='1'/>
      <parameter type-id='type-id-40' name='version' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='256' column='1'/>
      <parameter type-id='type-id-30' name='stream_size' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='256' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflateSetDictionary' mangled-name='zng_deflateSetDictionary' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateSetDictionary@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='419' column='1'/>
      <parameter type-id='type-id-38' name='dictionary' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='419' column='1'/>
      <parameter type-id='type-id-6' name='dictLength' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='419' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflateGetDictionary' mangled-name='zng_deflateGetDictionary' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateGetDictionary@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='478' column='1'/>
      <parameter type-id='type-id-39' name='dictionary' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='478' column='1'/>
      <parameter type-id='type-id-79' name='dictLength' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='478' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflateResetKeep' mangled-name='zng_deflateResetKeep' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateResetKeep@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='497' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflateReset' mangled-name='zng_deflateReset' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='536' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateReset@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='536' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflateSetHeader' mangled-name='zng_deflateSetHeader' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateSetHeader@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='546' column='1'/>
      <parameter type-id='type-id-17' name='head' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='546' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflatePending' mangled-name='zng_deflatePending' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='554' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflatePending@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='554' column='1'/>
      <parameter type-id='type-id-79' name='pending' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='554' column='1'/>
      <parameter type-id='type-id-87' name='bits' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='554' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflatePrime' mangled-name='zng_deflatePrime' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='565' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflatePrime@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='565' column='1'/>
      <parameter type-id='type-id-30' name='bits' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='565' column='1'/>
      <parameter type-id='type-id-30' name='value' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='565' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflateParams' mangled-name='zng_deflateParams' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='593' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateParams@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='593' column='1'/>
      <parameter type-id='type-id-30' name='level' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='593' column='1'/>
      <parameter type-id='type-id-30' name='strategy' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='593' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflateTune' mangled-name='zng_deflateTune' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='639' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateTune@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='639' column='1'/>
      <parameter type-id='type-id-30' name='good_length' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='639' column='1'/>
      <parameter type-id='type-id-30' name='max_lazy' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='639' column='1'/>
      <parameter type-id='type-id-30' name='nice_length' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='639' column='1'/>
      <parameter type-id='type-id-30' name='max_chain' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='639' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflateBound' mangled-name='zng_deflateBound' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateBound@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='669' column='1'/>
      <parameter type-id='type-id-4' name='sourceLen' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='669' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='zng_deflateCopy' mangled-name='zng_deflateCopy' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='1085' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateCopy@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='dest' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='1085' column='1'/>
      <parameter type-id='type-id-14' name='source' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='1085' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflateSetParams' mangled-name='zng_deflateSetParams' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='1661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateSetParams@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='1661' column='1'/>
      <parameter type-id='type-id-88' name='params' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='1661' column='1'/>
      <parameter type-id='type-id-9' name='count' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='1661' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_deflateGetParams' mangled-name='zng_deflateGetParams' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='1737' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_deflateGetParams@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='1737' column='1'/>
      <parameter type-id='type-id-88' name='params' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='1737' column='1'/>
      <parameter type-id='type-id-9' name='count' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.c' line='1737' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_tr_init' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='zng_tr_flush_block' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='386' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='zng_tr_flush_bits' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='387' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='zng_tr_align' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='388' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='zng_tr_stored_block' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='389' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='zng_calloc' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zutil.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='zng_cfree' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zutil.h' line='160' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-32'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/home/dank/src/zlib-ng/btmp1/src.d/deflate_fast.c' comp-dir-path='/home/dank/src/zlib-ng/btmp1' language='LANG_C99'>
    <function-decl name='fill_window' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='flush_pending' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate_p.h' line='19' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-32'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' comp-dir-path='/home/dank/src/zlib-ng/btmp1' language='LANG_C99'>
    <class-decl name='functable_s' size-in-bits='832' is-struct='yes' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='11' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='insert_string' type-id='type-id-90' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='quick_insert_string' type-id='type-id-91' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='adler32' type-id='type-id-92' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='crc32' type-id='type-id-93' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='slide_hash' type-id='type-id-94' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='compare258' type-id='type-id-95' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='longest_match' type-id='type-id-96' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='chunksize' type-id='type-id-97' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='chunkcopy' type-id='type-id-98' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='chunkcopy_safe' type-id='type-id-99' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='chunkunroll' type-id='type-id-100' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='chunkmemset' type-id='type-id-101' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='chunkmemset_safe' type-id='type-id-102' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-97'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-95'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-100'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-94'/>
    <function-decl name='slide_hash_c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/deflate.h' line='382' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='insert_string_c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='insert_string_sse4' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='quick_insert_string_c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='quick_insert_string_sse4' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='slide_hash_sse2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='slide_hash_avx2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='adler32_c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='adler32_ssse3' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='adler32_avx2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='chunksize_c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='chunkcopy_c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunkcopy_safe_c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunkunroll_c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-114'/>
      <parameter type-id='type-id-114'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunkmemset_c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunkmemset_safe_c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunksize_sse2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='chunkcopy_sse2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunkcopy_safe_sse2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunkunroll_sse2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-114'/>
      <parameter type-id='type-id-114'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunkmemset_sse2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunkmemset_safe_sse2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunksize_avx' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='chunkcopy_avx' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunkcopy_safe_avx' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunkunroll_avx' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-114'/>
      <parameter type-id='type-id-114'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunkmemset_avx' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='chunkmemset_safe_avx' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='crc32_generic' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='crc32_little' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='compare258_c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='compare258_unaligned_64' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='compare258_unaligned_sse4' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='compare258_unaligned_avx2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='longest_match_c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='longest_match_unaligned_64' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='longest_match_unaligned_sse4' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='longest_match_unaligned_avx2' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='functable' type-id='type-id-89' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/functable.h' line='27' column='1'/>
    <function-type size-in-bits='64' id='type-id-103'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-104'>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-105'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-106'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-107'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-108'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-109'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-110'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-111'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-114'/>
      <parameter type-id='type-id-114'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-112'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-113'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-115'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-116'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' comp-dir-path='/home/dank/src/zlib-ng/btmp1' language='LANG_C99'>
    <type-decl name='variadic parameter type' id='type-id-117'/>
    <typedef-decl name='gzFile' type-id='type-id-118' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1286' column='1' id='type-id-119'/>
    <class-decl name='gzFile_s' size-in-bits='192' is-struct='yes' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1812' column='1' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='have' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-15' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pos' type-id='type-id-8' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1815' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-121'/>
    <function-decl name='zng_gzopen' mangled-name='zng_gzopen' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzopen@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-40' name='path' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='215' column='1'/>
      <parameter type-id='type-id-40' name='mode' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='215' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='zng_gzdopen' mangled-name='zng_gzdopen' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzdopen@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-16' name='fd' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='226' column='1'/>
      <parameter type-id='type-id-40' name='mode' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='226' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='zng_gzclose' mangled-name='zng_gzclose' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzclose@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='245' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzbuffer' mangled-name='zng_gzbuffer' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzbuffer@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='260' column='1'/>
      <parameter type-id='type-id-3' name='size' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='260' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzrewind' mangled-name='zng_gzrewind' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzrewind@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='284' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzseek' mangled-name='zng_gzseek' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzseek@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='304' column='1'/>
      <parameter type-id='type-id-8' name='offset' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='304' column='1'/>
      <parameter type-id='type-id-16' name='whence' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='304' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zng_gztell' mangled-name='zng_gztell' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gztell@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='385' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zng_gzoffset' mangled-name='zng_gzoffset' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzoffset@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='411' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='zng_gzeof' mangled-name='zng_gzeof' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='442' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzeof@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='442' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzerror' mangled-name='zng_gzerror' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzerror@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='457' column='1'/>
      <parameter type-id='type-id-121' name='errnum' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='457' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='zng_gzclearerr' mangled-name='zng_gzclearerr' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='474' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzclearerr@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzlib.c' line='474' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='zng_gzclose_r' mangled-name='zng_gzclose_r' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzclose_r@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_gzclose_w' mangled-name='zng_gzclose_w' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1644' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzclose_w@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='540' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='lseek64' filepath='/usr/include/unistd.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='__open_2' filepath='/usr/include/x86_64-linux-gnu/bits/fcntl2.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='__open_too_many_args' filepath='/usr/include/x86_64-linux-gnu/bits/fcntl2.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='__open_missing_mode' filepath='/usr/include/x86_64-linux-gnu/bits/fcntl2.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-32'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' comp-dir-path='/home/dank/src/zlib-ng/btmp1' language='LANG_C99'>
    <class-decl name='gz_state' size-in-bits='1856' is-struct='yes' naming-typedef-id='type-id-122' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='106' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-120' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mode' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='fd' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='path' type-id='type-id-28' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='size' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='want' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='in' type-id='type-id-15' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='out' type-id='type-id-15' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='direct' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='how' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='start' type-id='type-id-8' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='eof' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='past' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='level' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='strategy' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reset' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='skip' type-id='type-id-8' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='seek' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='err' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='msg' type-id='type-id-28' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='strm' type-id='type-id-43' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gz_state' type-id='type-id-123' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='138' column='1' id='type-id-122'/>
    <typedef-decl name='__ssize_t' type-id='type-id-1' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='194' column='1' id='type-id-124'/>
    <typedef-decl name='ssize_t' type-id='type-id-124' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='108' column='1' id='type-id-125'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-126'/>
    <function-decl name='gz_error' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzguts.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='zng_gzread' mangled-name='zng_gzread' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzread@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='347' column='1'/>
      <parameter type-id='type-id-42' name='buf' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='347' column='1'/>
      <parameter type-id='type-id-3' name='len' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='347' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzfread' mangled-name='zng_gzfread' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='379' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzfread@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-42' name='buf' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='379' column='1'/>
      <parameter type-id='type-id-9' name='size' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='379' column='1'/>
      <parameter type-id='type-id-9' name='nitems' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='379' column='1'/>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='379' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='zng_gzgetc' mangled-name='zng_gzgetc' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzgetc@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='411' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzgetc_' mangled-name='zng_gzgetc_' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzgetc_@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='435' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzungetc' mangled-name='zng_gzungetc' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzungetc@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-16' name='c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='440' column='1'/>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='440' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzgets' mangled-name='zng_gzgets' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzgets@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='496' column='1'/>
      <parameter type-id='type-id-28' name='buf' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='496' column='1'/>
      <parameter type-id='type-id-16' name='len' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='496' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='zng_gzdirect' mangled-name='zng_gzdirect' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='557' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzdirect@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzread.c' line='557' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-121'/>
    </function-decl>
    <function-decl name='memchr' filepath='/usr/include/string.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='__read_chk' filepath='/usr/include/x86_64-linux-gnu/bits/unistd.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-125'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' comp-dir-path='/home/dank/src/zlib-ng/btmp1' language='LANG_C99'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-42' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <function-decl name='zng_gzwrite' mangled-name='zng_gzwrite' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzwrite@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='234' column='1'/>
      <parameter type-id='type-id-42' name='buf' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='234' column='1'/>
      <parameter type-id='type-id-3' name='len' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='234' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzfwrite' mangled-name='zng_gzfwrite' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzfwrite@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-42' name='buf' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='258' column='1'/>
      <parameter type-id='type-id-9' name='size' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='258' column='1'/>
      <parameter type-id='type-id-9' name='nitems' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='258' column='1'/>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='258' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='zng_gzputc' mangled-name='zng_gzputc' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzputc@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='287' column='1'/>
      <parameter type-id='type-id-16' name='c' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='287' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzputs' mangled-name='zng_gzputs' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzputs@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='332' column='1'/>
      <parameter type-id='type-id-40' name='s' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='332' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzvprintf' mangled-name='zng_gzvprintf' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzvprintf@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='356' column='1'/>
      <parameter type-id='type-id-40' name='format' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='356' column='1'/>
      <parameter type-id='type-id-128' name='va' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='356' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzprintf' mangled-name='zng_gzprintf' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzprintf@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='412' column='1'/>
      <parameter type-id='type-id-40' name='format' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='412' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzflush' mangled-name='zng_gzflush' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzflush@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='423' column='1'/>
      <parameter type-id='type-id-16' name='flush' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='423' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='zng_gzsetparams' mangled-name='zng_gzsetparams' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_gzsetparams@@ZLIB_NG_GZ_2.0.0'>
      <parameter type-id='type-id-119' name='file' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='452' column='1'/>
      <parameter type-id='type-id-16' name='level' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='452' column='1'/>
      <parameter type-id='type-id-16' name='strategy' filepath='/home/dank/src/zlib-ng/btmp1/src.d/gzwrite.c' line='452' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='write' filepath='/usr/include/unistd.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-125'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/home/dank/src/zlib-ng/btmp1/src.d/infback.c' comp-dir-path='/home/dank/src/zlib-ng/btmp1' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-129' size-in-bits='46208' id='type-id-130'>
      <subrange length='1444' type-id='type-id-4' id='type-id-131'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-58' size-in-bits='4608' id='type-id-132'>
      <subrange length='288' type-id='type-id-4' id='type-id-133'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-58' size-in-bits='5120' id='type-id-134'>
      <subrange length='320' type-id='type-id-4' id='type-id-135'/>
    </array-type-def>
    <enum-decl name='inflate_mode' naming-typedef-id='type-id-136' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='22' column='1' id='type-id-137'>
      <underlying-type type-id='type-id-80'/>
      <enumerator name='HEAD' value='16180'/>
      <enumerator name='FLAGS' value='16181'/>
      <enumerator name='TIME' value='16182'/>
      <enumerator name='OS' value='16183'/>
      <enumerator name='EXLEN' value='16184'/>
      <enumerator name='EXTRA' value='16185'/>
      <enumerator name='NAME' value='16186'/>
      <enumerator name='COMMENT' value='16187'/>
      <enumerator name='HCRC' value='16188'/>
      <enumerator name='DICTID' value='16189'/>
      <enumerator name='DICT' value='16190'/>
      <enumerator name='TYPE' value='16191'/>
      <enumerator name='TYPEDO' value='16192'/>
      <enumerator name='STORED' value='16193'/>
      <enumerator name='COPY_' value='16194'/>
      <enumerator name='COPY' value='16195'/>
      <enumerator name='TABLE' value='16196'/>
      <enumerator name='LENLENS' value='16197'/>
      <enumerator name='CODELENS' value='16198'/>
      <enumerator name='LEN_' value='16199'/>
      <enumerator name='LEN' value='16200'/>
      <enumerator name='LENEXT' value='16201'/>
      <enumerator name='DIST' value='16202'/>
      <enumerator name='DISTEXT' value='16203'/>
      <enumerator name='MATCH' value='16204'/>
      <enumerator name='LIT' value='16205'/>
      <enumerator name='CHECK' value='16206'/>
      <enumerator name='LENGTH' value='16207'/>
      <enumerator name='DONE' value='16208'/>
      <enumerator name='BAD' value='16209'/>
      <enumerator name='MEM' value='16210'/>
      <enumerator name='SYNC' value='16211'/>
    </enum-decl>
    <typedef-decl name='inflate_mode' type-id='type-id-137' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='55' column='1' id='type-id-136'/>
    <class-decl name='inflate_state' size-in-bits='57280' is-struct='yes' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='84' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='strm' type-id='type-id-14' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mode' type-id='type-id-136' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='last' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='wrap' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='havedict' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dmax' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='check' type-id='type-id-4' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='total' type-id='type-id-4' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='head' type-id='type-id-17' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='wbits' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='wsize' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='whave' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='wnext' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='window' type-id='type-id-15' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='hold' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='bits' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='length' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='offset' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='extra' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='lencode' type-id='type-id-139' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='distcode' type-id='type-id-139' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='lenbits' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='distbits' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='ncode' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='nlen' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='ndist' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='have' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='next' type-id='type-id-140' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='lens' type-id='type-id-134' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='work' type-id='type-id-132' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10944'>
        <var-decl name='codes' type-id='type-id-130' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57152'>
        <var-decl name='sane' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57184'>
        <var-decl name='back' type-id='type-id-16' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57216'>
        <var-decl name='was' type-id='type-id-3' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57248'>
        <var-decl name='chunksize' type-id='type-id-6' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inflate.h' line='128' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='code' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-129' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inftrees.h' line='27' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-2' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inftrees.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='bits' type-id='type-id-2' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inftrees.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='val' type-id='type-id-58' visibility='default' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inftrees.h' line='30' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='code' type-id='type-id-141' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inftrees.h' line='31' column='1' id='type-id-129'/>
    <enum-decl name='codetype' naming-typedef-id='type-id-142' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inftrees.h' line='57' column='1' id='type-id-143'>
      <underlying-type type-id='type-id-80'/>
      <enumerator name='CODES' value='0'/>
      <enumerator name='LENS' value='1'/>
      <enumerator name='DISTS' value='2'/>
    </enum-decl>
    <typedef-decl name='codetype' type-id='type-id-143' filepath='/home/dank/src/zlib-ng/btmp1/src.d/inftrees.h' line='61' column='1' id='type-id-142'/>
    <typedef-decl name='in_func' type-id='type-id-144' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1076' column='1' id='type-id-145'/>
    <typedef-decl name='out_func' type-id='type-id-146' filepath='/home/dank/src/zlib-ng/btmp1/src.d/zlib-ng.h' line='1077' column='1' id='type-id-147'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-140'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-148'/>
    <qualified-type-def type-id='type-id-129' const='yes' id='type-id-149'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-139'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-151'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-144'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-154'/>
    <function-decl name='zng_inflateBackInit_' mangled-name='zng_inflateBackInit_' filepath='/home/dank/src/zlib-ng/btmp1/src.d/infback.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_inflateBackInit_@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/infback.c' line='28' column='1'/>
      <parameter type-id='type-id-30' name='windowBits' filepath='/home/dank/src/zlib-ng/btmp1/src.d/infback.c' line='28' column='1'/>
      <parameter type-id='type-id-39' name='window' filepath='/home/dank/src/zlib-ng/btmp1/src.d/infback.c' line='28' column='1'/>
      <parameter type-id='type-id-40' name='version' filepath='/home/dank/src/zlib-ng/btmp1/src.d/infback.c' line='29' column='1'/>
      <parameter type-id='type-id-30' name='stream_size' filepath='/home/dank/src/zlib-ng/btmp1/src.d/infback.c' line='29' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='zng_inflateBack' mangled-name='zng_inflateBack' filepath='/home/dank/src/zlib-ng/btmp1/src.d/infback.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='zng_inflateBack@@ZLIB_NG_2.0.0'>
      <parameter type-id='type-id-14' name='strm' filepath='/home/dank/src/zlib-ng/btmp1/src.d/infback.c' line='130' column='1'/>
      <parameter type-id='type-id-145' name='in' filepath='/home/dank/src/zlib-ng/btmp1/src.d/infback.c' line='130' column='1'/>
      <parameter type-id='type-id-42' name='in_desc' filepath='/home/dank/src/zlib-ng/btmp1/src.d/infback.c' line='130' column='1'/>
      <parameter type-id='type-id-147' name='out' filepath='/home/dank/src/zlib-ng/btmp1/src.d/infback.c' line='130' column='1'/>
      <parameter type-id='type-id-42' name='out_desc' filepath='/home/dank/src/zlib-ng/btmp1/src.d/infback.c' line='130' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
